Repository: kenorb/arts
Catalog: sites/all/modules/contrib/gtranslate/translations/*.po
Languages: hu

source: Uses Google power to translate your web site. Author Edvard Ananyan http://edo.webmaster.am
hu: Google gépi fordítói szolgáltatásának használata, hogy a webhelyet más nyelven is automatikusan el lehessen érni. A szerző Edvard Ananyan (http://edo.webmaster.am)

source: General Configuration
hu: Általános beállítások

source: Translation Method
hu: Fordítási mód

source: Select which method shall be used when translating the page. Google Default will show only a dropdown provided by Google and it will translate the page on the fly, but you cannot configure it's appearance. On Fly (jQuery) can be configured, it will also use the on the fly translation method. Redirect method will redirect the visitor to the translated page, if the Pro version is installed it will use SEF URLs and keep the visitor on your domain, however this method cannot translate non-public pages.
hu: Itt választható ki az oldalak fordításának módja. A Google Default alapértelmezés szerint csak egy legördülő lista látszik és az oldalt azonnal lefordítja, de a megjelenés nem befolyásolható. Az On Fly (jQuery) már több beállítási lehetőséggel bír és szintén azonnal fordít. A Redirect mód átirányítja a látogatót egy különálló oldalra, amely Pro változat esetén keresőbarát webcímmel rendelkezik és a webhely domainjén belül helyezkedik el. Ez utóbbi módszer nem működik belső, nem nyilvános (például Intranet) oldalak esetében.

source: Appearance Configuration
hu: Megjelenés beállításai

source: Look
hu: Megtekintés

source: Select the look of the module.
hu: A modul megjelenítésének beállításai.

source: Flag Size
hu: Zászló mérete

source: Select the flag size in pixels.
hu: A zászló mérete képpontban megadva.

source: Open translated page in a new window
hu: Lefordított oldalak új ablakba

source: The translated page will appear in a new window.
hu: A lefordított oldalak új ablakban nyíljanak meg.

source: Language Configuration
hu: Nyelvi beállítások

source: Main Language
hu: Fő nyelv

source: Your sites main language
hu: A webhelyek fő nyelve

source: GTranslate module settings control
hu: GTranslate modul beállításai

source: Uses Google power to translate your web site.
hu: Google gépi fordítói szolgáltatásának használata, hogy a webhelyet más nyelven is automatikusan el lehessen érni.

source: Operate with Pro version
hu: Működés Pro változatként

source: If you have Pro version installed you need to check this box. Find out more on <a href=http://edo.webmaster.am/gtranslate target=_blank>http://edo.webmaster.am/gtranslate</a>
hu: A Pro változatnál az előnyök kihasználásához be kell jelölni. További információ a <a href=http://edo.webmaster.am/gtranslate target=_blank>http://edo.webmaster.am/gtranslate</a> oldalon érhető el.
